blog-posts/2006-02-05-why-i-like-the-emacs-editor.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Why I like the Emacs editor</title>
<!-- 2014-04-30 Wed 17:31 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Why I like the Emacs editor</h1>
<p>
February 5th, 2006 -
<a href="http://sachachua.com/blog/p/3257"><a href="http://sachachua.com/blog/p/3257">http://sachachua.com/blog/p/3257</a></a>
</p>

<p>
Most editors treat everyone the same. Emacs, on the other hand, becomes
 uniquely yours &#x2013; tamed, like the fox in The Little Prince. Let me
paraphrase:
</p>

<blockquote>
<p>
“No,” said the little prince. “I am looking for friends. What does
 that mean&#x2014;'customize'?”
</p>

<p>
“It is an act too often neglected,” said Emacs. “It means to
 establish ties.”
</p>

<p>
“‘To establish ties'?”
</p>

<p>
“Just that,” said Emacs. “To me, you are still nothing more than a
 user who is just like a hundred thousand other users. And I have no
 need of you. And you, on your part, have no need of me. To you, I am
 nothing more than a editor like a hundred thousand other editors. But
 if you customize me, then we shall need each other. To me, you will
be
 unique in all the world. To you, I shall be unique in all the
 world&#x2026;”
</p>
</blockquote>

<p>
And that is why I like Emacs. It may not be the perfect editor, but
 it's \<sub>mine</sub>.\_ =)
</p>

<p>
On Technorati: <a href="http://www.technorati.com/tag/emacs">emacs</a>
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
